app/controllers/pages_controller.rb

SELECT "subjects".* FROM "subjects" ORDER BY position ASC
SELECT COUNT(*) FROM "pages"
---
  def new
    @page = Page.new
    @subjects = Subject.order('position ASC')
    @page_count = Page.count + 1

INSERT INTO "pages" ("subject_id", "name", "permalink", "position", "visible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["subject_id", 1], ["name", "Page 4"], ["permalink", "4"], ["position", 3], ["visible", 1], ["created_at", "2021-09-24 14:27:11.242744"], ["updated_at", "2021-09-24 14:27:11.242744"]]
---
  def create
    @page = Page.new(page_params)

    if @page.save

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects" ORDER BY position ASC
SELECT COUNT(*) FROM "pages"
---
  def edit
    @page = Page.find(params[:id])
    @subjects = Subject.order('position ASC')
    @page_count = Page.count

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "pages" SET "position" = ?, "visible" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["position", 1], ["visible", 1], ["updated_at", "2021-09-24 14:31:27.923415"], ["id", 5]]
---
  def update
    @page = Page.find(params[:id])

    if @page.update(page_params)

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def delete
    @page = Page.find(params[:id])

DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 5]]
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def destroy
    page = Page.find(params[:id]).destroy