app/controllers/sections_controller.rb

INSERT INTO "sections" ("name", "position", "visible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "section 1"], ["position", 1], ["visible", 1], ["created_at", "2021-09-24 07:48:45.559705"], ["updated_at", "2021-09-24 07:48:45.559705"]]
---
  def create
    @section = Section.new(section_params)

    if @section.save

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @section = Section.find(params[:id])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "sections" SET "position" = ?, "updated_at" = ? WHERE "sections"."id" = ?  [["position", 2], ["updated_at", "2021-09-24 07:48:29.340385"], ["id", 1]]
---
  def update
    @section = Section.find(params[:id])

    if @section.update(section_params)

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def delete
    @section = Section.find(params[:id])

DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 1]]
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    section = Section.find(params[:id]).destroy