app/controllers/subjects_controller.rb

  def new
    @subject = Subject.new
    @subject_count = Subject.count + 1
---
SELECT COUNT(*) FROM "subjects"

  def create
    @subject = Subject.new(subject_params)

    if @subject.save
---
INSERT INTO "subjects" ("name", "position", "visible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Subject 1"], ["position", 1], ["visible", 1], ["created_at", "2021-09-23 14:19:49.644070"], ["updated_at", "2021-09-23 14:19:49.644070"]]

  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "subjects"

  def update
    @subject = Subject.find(params[:id])

    if @subject.update(subject_params)
      flash[:notice]="Subject updated successfully."
      redirect_to(:action =>'show', :id => @subject.id)
    else
      @subject_count =Subject.count
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "subjects" SET "name" = ?, "created_at" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["name", ""], ["created_at", "2021-09-23 15:14:00"], ["updated_at", "2021-09-24 14:52:46.779078"], ["id", 4]]
SELECT COUNT(*) FROM "subjects"

  def delete
    @subject = Subject.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy
    subject = Subject.find(params[:id]).destroy
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 2]]